import telebot
import constants
import constant

bot = telebot.TeleBot(constants.token)

#bot.send_message(336708361, "test")

upd = bot.get_updates()
#print(upd)

#last_upd = upd[-1]
#message_from_user = last_upd.message
#print(message_from_user)

@bot.message_handler(commands = ['start'])
def handle_start(message):
    user_markup = telebot.types.ReplyKeyboardMarkup(True, True)
    user_markup.row(u"\U0001F4A1"'Натисни тут'u"\U0001F4A1", u"\U0001F195"'Тут щось новеньке?'u"\U0001F195", 'Може тут?'u"\U0001F914")
    user_markup.row('Тут точно'u'\U0001f604', 'Тепер вгадалa)'u"\U0001F605")
    user_markup.row('Цього тут не було'u"\U0001F914", 'Це точно останнє!'u"\U0001F925"u"\U0001F925"u"\U0001F925", 'Не дістало ще?'u"\U0001F926\u200D\u2642\uFE0F")
    bot.send_message(message.from_user.id, 'Хороший бот, правда?', reply_markup = user_markup)

@bot.message_handler(commands = ['stop'])
def handle_start(message):
    hide_markup = telebot.types.ReplyKeyboardRemove(True)
    bot.send_message(message.from_user.id, 'Ти закрила клавіатуру!', reply_markup = hide_markup)

@bot.message_handler(content_types=['text'])
def handle_command(message):
    if message.text == u"\U0001F4A1"'Натисни тут'u"\U0001F4A1":
        bot.send_message(message.chat.id, 'Твоя краса неначе неземна,\nТвій голос наче птахів спів,\n'
    +'Твоя хода неначе небеса,\nТвій погляд має всю красу віків!\n\n'
        +u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"u"\U0001F940"
        +'\n\n© авторський')
    elif message.text == u"\U0001F195"'Тут щось новеньке?'u"\U0001F195":
        bot.send_message(message.chat.id, 'Напитись голосу твого,\nТого закоханого струму,\nТієї радості і суму,\nЧаклунства дивного того.\n\n'
        'Завмерти, слухати, не дихать,\nЗненацька думку перервать.\nТієї паузі безвихідь\nКрасивим жартом рятувать.\n\n'
        'Слова натягувать, як луки,\nЩоб вчасно збити на льоту\nНерозшифрованої муки\nНевідворотну німоту.\n\n'
    'Триматись вільно й незалежно,\nПеремовчати: хто кого.\n'
    +'І так беззахесно й безмежно\nЧекати голосу твого.\n\n'
    +u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"u"\U0001F337"
                         +'\n\n© Ліна Костенко')
    elif message.text == 'Може тут?'u"\U0001F914":
        bot.send_message(message.chat.id, 'Я вчу тебе, як іноземну мову!\nШукаю я тебе немов кришталь у воді!\n'
    +'Буває я не можу й вимовити слова,\nКоли дивлюся в очі я твої!\n\n'
    + "\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339""\U0001F339"
    + '\n\n© авторський')
    elif message.text == 'Тут точно'u'\U0001f604':
        bot.send_message(message.chat.id, 'Не закохуйся в обличчя,\nне закохуйся в вбрання,\n'
+'а закохуйся в ту душу,\nщо потрібна для життя!\n\nБо краса – це сон зрадливий,\n'

+'раз присниться та й нема.\nА душа – це все на світі,\nщо потрібно для життя.\n\n'
+u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"u"\U0001F338"
                         +'\n\n© Богдан Ступка')
    elif message.text == 'Тепер вгадалa)'u"\U0001F605":
        bot.send_message(message.chat.id, 'Цей день є радістю весни,\nНемов повернення у найсолодші сни,\n'
    +'Моменти для побачень і натхнень\nДіанин день, це є Діанин день!\n\n'
    +"\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490""\U0001F490"
                         +'\n\n© авторський(iз вчорашніми іменинами)')
    elif message.text == 'Цього тут не було'u"\U0001F914":
        bot.send_message(message.chat.id,'І як тепер тебе забути?\nДуша до краю добрела.\nТакої дивної отрути \nя ще ніколи не пила'
    +'\nТакої чистої печалі,\nТакої спраглої жаги,\nТакого зойку у мовчанні,\nТакого сяйва навкруги.'
    +'\nТакої зоряної тиші.\nТакого безміру в добі!..\nЦе, може, навіть і не вірші, \nА квіти, кинуті тобі.\n\n© Ліна Костенко')
    elif message.text == 'Це точно останнє!'u"\U0001F925"u"\U0001F925"u"\U0001F925":
        bot.send_message(message.chat.id,'Не знаю, чи побачу Вас, чи ні.\nА може, власне, і не в тому справа.\nА головне, що десь вдалечині\nЄ хтось такий, як невтоленна спрага.\n\n'
    +'Я не покличу щастя не моє.\nЛуна луни туди не долітає.\nЯ думаю про Вас. Я знаю, що Ви є.\nМоя душа й від цього вже світає.\n\n© Ліна Костенко')
    elif message.text == 'Не дістало ще?'u"\U0001F926\u200D\u2642\uFE0F":
        bot.send_message(message.chat.id,'Які  щасливі  очі  у  казок!\nЯ  прокидаюсь,  серце  калатає.\nЗима  стоїть  персидська,  як  бузок,\nі  жоден  птах  її  не  хилитає.\n\n'
        +'Мої  палаци,  вежі  крижані,\nя  в  першу  мить  не  знаю  навіть,  де  я,  -\nчи  там,  в  дитинстві,  чи  іще  у  сні,\nчи  в  Ірпені,  чи  в  царстві  Берендея.\n\n'
        +'Я  в  першу  мить  не  знаю,  що  це  -  я.\nСосновий  світ  здивовано  вивчаю.\nЯ  прокидаюсь.  І  твоє  ім\'я\nнаповнить  душу  сонцем  і  печаллю. \n\n© Ліна Костенко')
    else:
        bot.send_message(message.chat.id, 'Обери кнопку!')


bot.polling(none_stop = True, interval = 0)
